---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AddInIdAttribute Properties
AddInIdAttribute Class See Also Send Feedback
---

The AddInIdAttribute type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | TypeId | When implemented in a derived class, gets a unique identifier for this Attribute. (Inherited from Attribute.) |
|  | Value | AddInId guid value. |

# See Also

AddInIdAttribute Class

Autodesk.Revit.DB.Macros Namespace